# St7GetSolverNonlinearGeometry

Returns the state assigned for the Nonlinear Geometry option for nonlinear analyses.

long St7GetSolverNonlinearGeometry(long uID, bool* NonlinearGeometry)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

NonlinearGeometry

True if the Nonlinear Geometry option is enabled.